In [1]:
import pandas as pd
import numpy as np

In [2]:
df3 = pd.DataFrame({"Id":[1,2,3,4,5,6,7],"Marks":[100,60,70,60,40,60,40]})
df3

   Id  Marks
0   1    100
1   2     60
2   3     70
3   4     60
4   5     40
5   6     60
6   7     40

In [3]:
df3['Marks'].unique()

array([100,  60,  70,  40], dtype=int64)

In [4]:
df3['Marks'].value_counts()

60     3
40     2
100    1
70     1
Name: Marks, dtype: int64

In [5]:
df3['Marks'].values

array([100,  60,  70,  60,  40,  60,  40], dtype=int64)

In [6]:
df3.rename(columns={"Marks":"Percentage"},inplace = True)
df3

   Id  Percentage
0   1         100
1   2          60
2   3          70
3   4          60
4   5          40
5   6          60
6   7          40

ID :101, 102, 103,
Department :'B.Sc','B.Tech','M.Tech',
Semester:1
year:2022

In [11]:
a={"ID":[101,102,103],"Deprtment":["B.Sc","B.Tech","M.Tech"],"Semester":[1,1,1],"Year":[2022,2022,2022]} 
info = pd.DataFrame(a)
print(info)

    ID Deprtment  Semester  Year
0  101      B.Sc         1  2022
1  102    B.Tech         1  2022
2  103    M.Tech         1  2022

## Create a DataFrame birds from this dictionary data which has the index labels.

In [5]:
data = {'birds': ['Cranes', 'Cranes', 'plovers', 'spoonbills', 'spoonbills', 'Cranes', 'plovers', 'Cranes', 'spoonbills', 'spoonbills'], 'age': [3.5, 4, 1.5, np.nan, 6, 3, 5.5, np.nan, 8, 4], 'visits': [2, 4, 3, 4, 3, 4, 2, 2, 3, 2], 'priority': ['yes', 'yes', 'no', 'yes', 'no', 'no', 'no', 'yes', 'no', 'no']}

In [10]:
labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']
b= pd.DataFrame(data, index= labels)
b

        birds  age  visits priority
a      Cranes  3.5       2      yes
b      Cranes  4.0       4      yes
c     plovers  1.5       3       no
d  spoonbills  NaN       4      yes
e  spoonbills  6.0       3       no
f      Cranes  3.0       4       no
g     plovers  5.5       2       no
h      Cranes  NaN       2      yes
i  spoonbills  8.0       3       no
j  spoonbills  4.0       2       no

## Display a summary of the basic information about birds DataFrame and its data.

In [13]:
b.info()

<class 'pandas.core.frame.DataFrame'>
Index: 10 entries, a to j
Data columns (total 4 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   birds     10 non-null     object
 1   age       8 non-null      float64
 2   visits    10 non-null     int64
 3   priority  10 non-null     object
dtypes: float64(1), int64(1), object(2)
memory usage: 400.0+ bytes

## select [2, 3, 7] rows and in columns ['birds', 'age', 'visits']

In [25]:
# a= df[df.BasePay>10000][['EmployeeName','Agency','JobTitle']]
a= b.loc[['c', 'd', 'h'], ['birds', 'age', 'visits']]
a

        birds  age  visits
c     plovers  1.5       3
d  spoonbills  NaN       4
h      Cranes  NaN       2

In [30]:
# sub= b[['birds', 'age', 'visits']].loc[['c', 'd', 'h']]
sub= b[['birds', 'age', 'visits']].iloc[[2, 3, 7]]
sub

        birds  age  visits
c     plovers  1.5       3
d  spoonbills  NaN       4
h      Cranes  NaN       2

In [29]:
b[b['visits']<4]

        birds  age  visits priority
a      Cranes  3.5       2      yes
c     plovers  1.5       3       no
e  spoonbills  6.0       3       no
g     plovers  5.5       2       no
h      Cranes  NaN       2      yes
i  spoonbills  8.0       3       no
j  spoonbills  4.0       2       no

In [31]:
# Replacing long weathersit names into string values for better readability and understanding

# 1-Clear, Few clouds, Partly cloudy, Partly cloudy
BS_day.loc[(BS_day['weathersit'] == 1) , 'weathersit'] = 'A'

NameError: name 'BS_day' is not defined

In [6]:
n = int(input())



for i in range(1,n+1):
    dict= {i:i**2}
    
dict

4

{4: 16}